# DBeam_SetBShutDepth

## Description
```pascal
PROCEDURE DBeam_SetBShutDepth(depth : INTEGER);
```

```python

def vs.DBeam_SetBShutDepth(depth):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|depth|INTEGER||

## Version
Availability: from Vectorworks 2011
## Category
* Spotlight